In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
ser1 = Series(np.arange(3),index=['a','b','c'])

In [3]:
ser1

a    0
b    1
c    2
dtype: int32

In [4]:
ser1.drop('b')

a    0
c    2
dtype: int32

In [6]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)),index=['SF','LA','NY'],columns=['pop','size','year'])
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

To drop a row, call dorp on DataFrame

In [7]:
dframe1.drop('LA')

    pop  size  year
SF    0     1     2
NY    6     7     8

In [8]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

As we see drop doesnt drop the index in original data. To drop it specify inpace=True

In [9]:
dframe1.drop('LA', inplace=True)

In [10]:
dframe1

    pop  size  year
SF    0     1     2
NY    6     7     8

Now dropping columns

In [12]:
dframe1.drop('year',axis=1, inplace=True)

In [13]:
dframe1

    pop  size
SF    0     1
NY    6     7

---

Ranking and sorting

In [14]:
dframe1 = DataFrame(np.arange(9).reshape((3,3)),index=['SF','LA','NY'],columns=['pop','size','year'])
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [16]:
dframe1.sort_index() #sort by index

    pop  size  year
LA    3     4     5
NY    6     7     8
SF    0     1     2

In [19]:
#sort by values

dframe1.sort_values('size')

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [20]:
dframe1.sort_values('pop')

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [ ]:
#Ranking

In [21]:
dframe1.rank()

    pop  size  year
SF  1.0   1.0   1.0
LA  2.0   2.0   2.0
NY  3.0   3.0   3.0

In [22]:
ser3 = Series(np.random.randn(10))

In [23]:
ser3.rank()

0     2.0
1     1.0
2     4.0
3     6.0
4     5.0
5     7.0
6    10.0
7     9.0
8     8.0
9     3.0
dtype: float64

In [26]:
ser3.sort_values()

1   -3.428396
0   -2.250114
9   -1.747540
2   -0.773415
4    0.084524
3    0.460725
5    0.463034
8    0.943201
7    1.118600
6    1.126839
dtype: float64